Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol
The SectionMarkSymbol class is for section mark attributes related to the shape of the connecting symbol.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.Shape
The shape of the section mark symbol.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.Size
The size of the section mark symbol.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.Position
The position of the section mark symbol.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.#ctor
Creates a new section mark symbol instance.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.#ctor(Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes,System.Double,Tekla.Structures.Geometry3d.Point)
Creates a new section mark symbol instance with the given shape, size and position.
shape: The shape of the section mark symbol to be used.
size: The size of the section mark symbol to be used.
position: The position of the section mark symbol to be used.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.